In [1]:
import pandas as pd
# Import the SQL ALchemy engine
from sqlalchemy import create_engine

In [12]:
# Database credentials

postgres_user = 'dsbc_student'
postgres_pw = '7*.8G9QH21'
postgres_host = '142.93.121.174'
postgres_port = '5432'
postgres_db = 'baseball'


# use the credentials to start a connection
engine = create_engine('postgresql://{}:{}@{}:{}/{}'.format(
    postgres_user, postgres_pw, postgres_host, postgres_port, postgres_db))

In [15]:
people_df = pd.read_sql_table('people', engine)

In [16]:
people_df.head()

,playerid,birthyear,birthcountry,deathyear,namefirst,namelast,weight,height,bats,throws
0,aardsda01,1981.0,USA,NaN,David,Aardsma,215.0,75.0,R,R
1,aaronha01,1934.0,USA,NaN,Hank,Aaron,180.0,72.0,R,R
2,aaronto01,1939.0,USA,1984.0,Tommie,Aaron,190.0,75.0,R,R
3,aasedo01,1954.0,USA,NaN,Don,Aase,190.0,75.0,R,R
4,abadan01,1972.0,USA,NaN,Andy,Abad,184.0,73.0,L,L

In [17]:
people_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19370 entries, 0 to 19369
Data columns (total 10 columns):
playerid        19370 non-null object
birthyear       19244 non-null float64
birthcountry    19302 non-null object
deathyear       9550 non-null float64
namefirst       19332 non-null object
namelast        19370 non-null object
weight          18533 non-null float64
height          18615 non-null float64
bats            18185 non-null object
throws          18391 non-null object
dtypes: float64(4), object(6)
memory usage: 1.5+ MB

In [20]:
people_df.columns

Index(['playerid', 'birthyear', 'birthcountry', 'deathyear', 'namefirst',
       'namelast', 'weight', 'height', 'bats', 'throws'],
      dtype='object')

In [21]:
hof_inducted = pd.read_sql_table('hof_inducted', engine)

In [22]:
hof_inducted.head()

,playerid,yearid,votedby,ballots,needed,votes,inducted,category,needed_note
0,cobbty01,1936,BBWAA,226.0,170.0,222.0,Y,Player,None
1,ruthba01,1936,BBWAA,226.0,170.0,215.0,Y,Player,None
2,wagneho01,1936,BBWAA,226.0,170.0,215.0,Y,Player,None
3,mathech01,1936,BBWAA,226.0,170.0,205.0,Y,Player,None
4,johnswa01,1936,BBWAA,226.0,170.0,189.0,Y,Player,None

In [23]:
hof_inducted.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 323 entries, 0 to 322
Data columns (total 9 columns):
playerid       323 non-null object
yearid         323 non-null int64
votedby        323 non-null object
ballots        126 non-null float64
needed         123 non-null float64
votes          126 non-null float64
inducted       323 non-null object
category       323 non-null object
needed_note    3 non-null object
dtypes: float64(3), int64(1), object(5)
memory usage: 22.8+ KB

In [24]:
hof_inducted.columns

Index(['playerid', 'yearid', 'votedby', 'ballots', 'needed', 'votes',
       'inducted', 'category', 'needed_note'],
      dtype='object')

In [25]:
hof_not_inducted = pd.read_sql_table('hof_not_inducted', engine)

In [26]:
hof_not_inducted.head()

,playerid,yearid,votedby,ballots,needed,votes,inducted,category,needed_note
0,lajoina01,1936,BBWAA,226,170.0,146,N,Player,None
1,speaktr01,1936,BBWAA,226,170.0,133,N,Player,None
2,youngcy01,1936,BBWAA,226,170.0,111,N,Player,None
3,hornsro01,1936,BBWAA,226,170.0,105,N,Player,None
4,cochrmi01,1936,BBWAA,226,170.0,80,N,Player,None

In [27]:
hof_not_inducted.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3868 entries, 0 to 3867
Data columns (total 9 columns):
playerid       3868 non-null object
yearid         3868 non-null int64
votedby        3868 non-null object
ballots        3868 non-null int64
needed         3714 non-null float64
votes          3868 non-null int64
inducted       3868 non-null object
category       3868 non-null object
needed_note    154 non-null object
dtypes: float64(1), int64(3), object(5)
memory usage: 272.1+ KB

In [28]:
hof_not_inducted.columns

Index(['playerid', 'yearid', 'votedby', 'ballots', 'needed', 'votes',
       'inducted', 'category', 'needed_note'],
      dtype='object')

In [29]:
salaries = pd.read_sql_table('salaries', engine)

In [30]:
salaries.head()

   yearid teamid lgid   playerid  salary
0    1985    ATL   NL  barkele01  870000
1    1985    ATL   NL  bedrost01  550000
2    1985    ATL   NL  benedbr01  545000
3    1985    ATL   NL   campri01  633333
4    1985    ATL   NL  ceronri01  625000

In [31]:
salaries.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26428 entries, 0 to 26427
Data columns (total 5 columns):
yearid      26428 non-null int64
teamid      26428 non-null object
lgid        26428 non-null object
playerid    26428 non-null object
salary      26428 non-null int64
dtypes: int64(2), object(3)
memory usage: 1.0+ MB

In [32]:
salaries.columns

Index(['yearid', 'teamid', 'lgid', 'playerid', 'salary'], dtype='object')

### Question 1

Draw a schema of the relationship between the people, salaries, and hof_inducted tables.

    ==> These are one-to-many relationships

### Question 2

Write a query that returns the namefirst and namelast fields of the people table, along with the inducted field from the hof_inducted table. All rows from the people table should be returned, and NULL values for the fields from hof_inducted should be returned when there is no match found.

In [35]:
sql = '''
SELECT namefirst, namelast, inducted
FROM people LEFT OUTER JOIN hof_inducted
ON people.playerid = hof_inducted.playerid;
'''

results = engine.execute(sql)
engine.dispose()
rows = results.fetchall()

# print some results just to see what we got
for row in rows[:5]:
  print(row)

('David', 'Aardsma', None)
('Hank', 'Aaron', 'Y')
('Tommie', 'Aaron', None)
('Don', 'Aase', None)
('Andy', 'Abad', None)

### Question 3

In 2006, a special Baseball Hall of Fame induction was conducted for players from the negro baseball leagues of the 20th century. In that induction, 17 players were posthumously inducted into the Baseball Hall of Fame. Write a query that returns the first and last names, birth and death dates, and birth countries for these players.

* Note that the year of induction was 2006, and the value for votedby will be “Negro League.”

In [40]:
sql = '''
SELECT namefirst, namelast, birthyear, deathyear
FROM people LEFT OUTER JOIN hof_inducted
ON people.playerid = hof_inducted.playerid
WHERE yearid = 2006 AND votedby = 'Negro League'; '''


results = engine.execute(sql)
engine.dispose()
rows = results.fetchall()

# print some results just to see what we got
for row in rows[:5]:
  print(row)

('Ray', 'Brown', 1908, 1965)
('Willard', 'Brown', 1915, 1996)
('Andy', 'Cooper', 1898, 1941)
('Frank', 'Grant', 1865, 1937)
('Pete', 'Hill', 1882, 1951)

### Question 4

Write a query that returns the yearid, playerid, teamid, and salary fields from the salaries table, along with the category field from the hof_inducted table. Keep only the records that are in both salaries and hof_inducted. 

* While a field named yearid is found in both tables, don’t JOIN by it. You must, however, explicitly name which field to include.

In [42]:
sql = '''
SELECT salaries.yearid, salaries.playerid, teamid, salary, category
FROM salaries INNER JOIN hof_inducted
ON salaries.playerid = hof_inducted.playerid; '''

results = engine.execute(sql)
engine.dispose()
rows = results.fetchall()

# print some results just to see what we got
for row in rows[:5]:
  print(row)

(1985, 'suttebr01', 'ATL', 1354167, 'Player')
(1985, 'murraed02', 'BAL', 1472819, 'Player')
(1985, 'ripkeca01', 'BAL', 800000, 'Player')
(1985, 'boggswa01', 'BOS', 1000000, 'Player')
(1985, 'riceji01', 'BOS', 779227, 'Player')

### Question 5

Write a query that returns the playerid, yearid, teamid, lgid, and salary fields from the salaries table and the inducted field from the hof_inducted table. Keep all records from both tables.

In [43]:
sql = '''
SELECT salaries.playerid, salaries.yearid, salaries.teamid, salaries.lgid, salary, hof_inducted.inducted
FROM hof_inducted FULL OUTER JOIN salaries
ON hof_inducted.playerid = salaries.playerid; '''


results = engine.execute(sql)
engine.dispose()
rows = results.fetchall()

# print some results just to see what we got
for row in rows[:5]:
  print(row)

('barkele01', 1985, 'ATL', 'NL', 870000, None)
('bedrost01', 1985, 'ATL', 'NL', 550000, None)
('benedbr01', 1985, 'ATL', 'NL', 545000, None)
('campri01', 1985, 'ATL', 'NL', 633333, None)
('ceronri01', 1985, 'ATL', 'NL', 625000, None)

### Question 6

There are 2 tables, hof_inducted and hof_not_inducted, indicating successful and unsuccessful inductions into the Baseball Hall of Fame, respectively.

1) Combine these 2 tables by all fields. Keep all records.

2) Get a distinct list of all player IDs for players who have been put up for HOF induction.

In [45]:
sql = '''
SELECT * FROM hof_inducted
UNION ALL
SELECT * FROM hof_not_inducted; '''

results = engine.execute(sql)
engine.dispose()
rows = results.fetchall()

# print some results just to see what we got
for row in rows[:5]:
  print(row)

('cobbty01', 1936, 'BBWAA', 226, 170, 222, 'Y', 'Player', None)
('ruthba01', 1936, 'BBWAA', 226, 170, 215, 'Y', 'Player', None)
('wagneho01', 1936, 'BBWAA', 226, 170, 215, 'Y', 'Player', None)
('mathech01', 1936, 'BBWAA', 226, 170, 205, 'Y', 'Player', None)
('johnswa01', 1936, 'BBWAA', 226, 170, 189, 'Y', 'Player', None)

In [46]:
sql = '''
SELECT playerid FROM hof_inducted
UNION
SELECT playerid FROM hof_not_inducted; '''

results = engine.execute(sql)
engine.dispose()
rows = results.fetchall()

# print some results just to see what we got
for row in rows[:5]:
  print(row)

('dunnja01',)
('mitchke01',)
('morame01',)
('willijo99',)
('maysca01',)

### Question 7

Write a query that returns the last name, first name (see people table), and total recorded salaries for all players found in the salaries table.

In [47]:
sql = '''
SELECT namelast, namefirst, SUM(salary)
FROM salaries LEFT OUTER JOIN people
ON salaries.playerid = people.playerid
GROUP BY namelast, namefirst
ORDER BY namelast, namefirst; '''

results = engine.execute(sql)
engine.dispose()
rows = results.fetchall()

# print some results just to see what we got
for row in rows[:5]:
  print(row)

('Aardsma', 'David', 9259750)
('Aase', 'Don', 2300000)
('Abad', 'Andy', 327000)
('Abad', 'Fernando', 3766400)
('Abbott', 'Jeff', 985000)

### Question 8

Write a query that returns all records from the hof_inducted and hof_not_inducted tables that include playerid, yearid, namefirst, and namelast. 

* Hint: Each FROM statement will include a LEFT OUTER JOIN!

In [51]:
sql = '''
SELECT hof_inducted.playerid, yearid, namefirst, namelast
FROM hof_inducted LEFT OUTER JOIN people
ON hof_inducted.playerid = people.playerid

UNION ALL

SELECT hof_not_inducted.playerid, yearid, namefirst, namelast
FROM hof_not_inducted LEFT OUTER JOIN people
ON hof_not_inducted.playerid = people.playerid; '''


results = engine.execute(sql)
engine.dispose()
rows = results.fetchall()

# print some results just to see what we got
for row in rows[:5]:
  print(row)

('aaronha01', 1982, 'Hank', 'Aaron')
('alexape01', 1938, 'Pete', 'Alexander')
('alomaro01', 2011, 'Roberto', 'Alomar')
('alstowa01', 1983, 'Walter', 'Alston')
('andersp01', 2000, 'Sparky', 'Anderson')

### Question 9

Return a table including all records from both hof_inducted and hof_not_inducted, and include a new field, namefull, which is formatted as namelast , namefirst (in other words, the last name, followed by a comma, then a space, then the first name). The query should also return the yearid and inducted fields. Include only records since 1980 from both tables. Sort the resulting table by yearid, then inducted so that Y comes before N. Finally, sort by the namefull field, A to Z.

In [52]:
sql = '''
SELECT concat(namelast,', ', namefirst) AS namefull, yearid, inducted
FROM hof_inducted LEFT OUTER JOIN people
ON hof_inducted.playerid = people.playerid
WHERE yearid >= 1980

UNION ALL 

SELECT concat(namelast,', ', namefirst) AS namefull, yearid, inducted
FROM hof_not_inducted LEFT OUTER JOIN people
ON hof_not_inducted.playerid = people.playerid
WHERE yearid >= 1980

ORDER BY yearid,  inducted DESC, namefull; '''

results = engine.execute(sql)
engine.dispose()
rows = results.fetchall()

# print some results just to see what we got
for row in rows[:5]:
  print(row)

('Kaline, Al', 1980, 'Y')
('Klein, Chuck', 1980, 'Y')
('Snider, Duke', 1980, 'Y')
('Yawkey, Tom', 1980, 'Y')
('Aker, Jack', 1980, 'N')

### Question 10

Write a query that returns the highest annual salary for each teamid, ranked from high to low, along with the corresponding playerid. Bonus! Return namelast and namefirst in the resulting table. (You can find these in the people table.)

In [53]:
sql = '''
WITH max AS
(SELECT MAX(salary) as max_salary, teamid, yearid
FROM salaries
GROUP BY teamid, yearid)
SELECT salaries.yearid, salaries.teamid, playerid, max.max_salary
FROM max LEFT OUTER JOIN salaries
ON salaries.teamid = max.teamid AND salaries.yearid = max.yearid AND salaries.salary = max.max_salary
ORDER BY max.max_salary DESC; '''

results = engine.execute(sql)
engine.dispose()
rows = results.fetchall()

# print some results just to see what we got
for row in rows[:5]:
  print(row)

(2016, 'LAN', 'kershcl01', 33000000)
(2009, 'NYA', 'rodrial01', 33000000)
(2010, 'NYA', 'rodrial01', 33000000)
(2015, 'LAN', 'kershcl01', 32571000)
(2011, 'NYA', 'rodrial01', 32000000)

### Question 11

Select birthyear, deathyear, namefirst, and namelast of all the players born since the birth year of Babe Ruth (playerid = ruthba01). Sort the results by birth year from low to high.

In [54]:
sql = '''
SELECT birthyear, deathyear, namefirst, namelast
FROM people
WHERE birthyear > ANY
	(SELECT	birthyear
	FROM people
	WHERE playerid = 'ruthba01')
ORDER BY birthyear;'''

results = engine.execute(sql)
engine.dispose()
rows = results.fetchall()

# print some results just to see what we got
for row in rows[:5]:
  print(row)

(1896, 1978, 'Mike', 'Wilson')
(1896, 1983, 'Chick', 'Sorrells')
(1896, 1963, 'Merito', 'Acosta')
(1896, 1962, 'Mutt', 'Wilson')
(1896, 1950, 'Dick', 'McCabe')

### Question 12

Using the people table, write a query that returns namefirst, namelast, and a field called usaborn where. The usaborn field should show the following: if the player's birthcountry is the USA, then the record is 'USA.' Otherwise, it's 'non-USA.' Order the results by 'non-USA' records first.

In [55]:
sql = '''
SELECT namefirst, namelast, 
	CASE
		WHEN birthcountry = 'USA' THEN 'USA'
		ELSE 'non-USA'
	END AS usaborn
FROM people
ORDER BY 3; '''

results = engine.execute(sql)
engine.dispose()
rows = results.fetchall()

# print some results just to see what we got
for row in rows[:5]:
  print(row)

('Andre', 'Rienzo', 'non-USA')
('Juan', 'Castillo', 'non-USA')
('Juan', 'Castillo', 'non-USA')
('Lendy', 'Castillo', 'non-USA')
('Luis', 'Castillo', 'non-USA')

### Question 13

Calculate the average height for players throwing with their right hand versus their left hand. Name these fields right_height and left_height, respectively.

In [57]:
sql = '''
SELECT
AVG(CASE WHEN throws = 'R' THEN height END) AS right_height,
AVG(CASE WHEN throws = 'L' THEN height END) AS left_height
FROM people; '''

results = engine.execute(sql)
engine.dispose()
rows = results.fetchall()

# print some results just to see what we got
for row in rows[:5]:
  print(row)

(Decimal('72.3172024506092104'), Decimal('72.5530219780219780'))

### Question 14

Get the average of each team's maximum player salary since 2010. Hint: WHERE will go inside your CTE.

In [58]:
sql = '''
WITH max_sal_by_team_by_year AS
(
SELECT teamid, yearid, MAX(salary) AS max_sal
FROM salaries
GROUP BY teamid, yearid
)
SELECT teamid, AVG(max_sal) AS avg_max_sal_since_2010
FROM max_sal_by_team_by_year
WHERE yearid > 2010
GROUP BY teamid; '''

results = engine.execute(sql)
engine.dispose()
rows = results.fetchall()

# print some results just to see what we got
for row in rows[:5]:
  print(row)

('HOU', Decimal('13133333.333333333333'))
('PIT', Decimal('12930555.500000000000'))
('SLN', Decimal('17897041.000000000000'))
('ARI', Decimal('13066505.000000000000'))
('OAK', Decimal('9811111.166666666667'))